void main() {
  // =========================================================
  // ЗАДАНИЕ №1: Кофемашина
  // =========================================================
  String zheton = "Капучино";

  switch (zheton) {
    case "Эспрессо":
      print("Ваш Эспрессо готов!");
      break;
    case "Капучино":
      print("Ваш Капучино с пенкой готов!");
      break;
    case "Латте":
      print("Ваш нежный Латте готов!");
      break;
    default:
      print("Ошибка: такого кофе в автомате нет! Проверьте жетон.");
  }

  print("\n-----------------------------------------\n"); 

  // =========================================================
  // ЗАДАНИЕ №2: Календарь
  // =========================================================
  String day = "Суббота";

  switch (day) {
    case "Понедельник":
    case "Вторник":
    case "Среда":
    case "Четверг":
    case "Пятница":
      print("$day — это рабочий день.");
      break;
      
    case "Суббота":
    case "Воскресенье":
      print("$day — это выходной день.");
      break;
      
    default:
      print("Ошибка: введите корректный день недели с большой буквы.");
  }
}